InformationRegisters/НастройкиСервисаКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСервисаКабинетСотрудника</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Идентификатор информационной системы в сервисе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Наименования информационной системы в сервисе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПриложения</Name>
					<Comment>Идентификатор приложения в сервисе, в котором развернута информационная система</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполнятьРегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АбонентСервисаИнициализирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетсяАктивацияТестовогоТарифа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТестовыйТарифАктивирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщениеОбАктивацииТестовогоТарифаОтправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиСервисаКабинетСотрудника/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция НастройкиСервиса() Экспорт
	
	Настройки = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	
	СтруктураНастроек = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
							Настройки, Метаданные.РегистрыСведений.НастройкиСервисаКабинетСотрудника);
							
	Возврат СтруктураНастроек;

КонецФункции

Процедура ВключитьВыполнениеРегламентногоЗадания() Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей[0].ВыполнятьРегламентноеЗадание = Истина;
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьТестовыйТарифАктивирован(ТестовыйТарифАктивирован) Экспорт
	
	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 И ТестовыйТарифАктивирован <> НаборЗаписей[0].ТестовыйТарифАктивирован Тогда
		НаборЗаписей[0].ТестовыйТарифАктивирован = ТестовыйТарифАктивирован;
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьАбонентСервисаИнициализирован() Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 И Не НаборЗаписей[0].АбонентСервисаИнициализирован Тогда
		НаборЗаписей[0].АбонентСервисаИнициализирован = Истина;
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьСообщениеОбАктивацииТестовогоТарифаОтправлено() Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 И Не НаборЗаписей[0].СообщениеОбАктивацииТестовогоТарифаОтправлено Тогда
		НаборЗаписей[0].СообщениеОбАктивацииТестовогоТарифаОтправлено = Истина;
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьТребуетсяАктивацияТестовогоТарифа(НовоеЗначение) Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиСервисаКабинетСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Записывать = Ложь;
	Если НаборЗаписей.Количество() > 0 Тогда
		Если НовоеЗначение <> НаборЗаписей[0].ТребуетсяАктивацияТестовогоТарифа Тогда
			НаборЗаписей[0].ТребуетсяАктивацияТестовогоТарифа = НовоеЗначение;
			Записывать = Истина;
		КонецЕсли;
	Иначе
		ЗаписьНабора = НаборЗаписей.Добавить();
		НаборЗаписей[0].ТребуетсяАктивацияТестовогоТарифа = НовоеЗначение;
		Записывать = Истина;
	КонецЕсли;
	
	Если Записывать Тогда
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#КонецЕсли
